{
  "items": [
    {
      "topic": "Service Academies overview",
      "keywords": [
        "academy",
        "west point",
        "naval academy",
        "air force academy",
        "coast guard academy",
        "merchant marine"
      ],
      "answer": "Service Academies are federally-funded four-year colleges that commission officers. Start early: rigorous academics, leadership, fitness, strong recommendations, and official-source verification of current requirements. Build a Plan B (ROTC) and Plan C (enlist then commission later)."
    },
    {
      "topic": "ROTC overview",
      "keywords": [
        "rotc",
        "scholarship",
        "commission",
        "cadet"
      ],
      "answer": "ROTC is a college-based commissioning pathway. Students compete for scholarships and/or campus-based contracting. Focus on academics, leadership impact, fitness habits, and interview readiness. Verify branch-specific rules on official ROTC sites each year."
    },
    {
      "topic": "Enlistment + later commissioning",
      "keywords": [
        "enlist",
        "recruiter",
        "asvab",
        "mos",
        "afsc",
        "ots",
        "ocs"
      ],
      "answer": "Enlistment can provide training, pay, and education benefits. Many service members later pursue commissioning programs (policies vary). Use Cadet Compass to choose a career field, prepare questions for recruiters, and verify benefits and contracts using official sources before signing."
    },
    {
      "topic": "Leadership evidence",
      "keywords": [
        "leadership",
        "captain",
        "officer",
        "club",
        "service",
        "volunteer"
      ],
      "answer": "Competitive pathways reward evidence of leadership: roles with responsibility, measurable impact, and sustained commitment. Track outcomes (hours, people served, funds raised, tutoring results) and convert them into resume bullets."
    },
    {
      "topic": "Fitness",
      "keywords": [
        "fitness",
        "pt",
        "workout",
        "run",
        "push"
      ],
      "answer": "Fitness is a multi-year advantage. Start with a realistic weekly plan (cardio + strength + mobility). Log workouts, set monthly goals, and connect training to your target pathway’s official fitness assessment guidance."
    },
    {
      "topic": "Texas CCMR alignment",
      "keywords": [
        "texas",
        "ccmr",
        "endorsement",
        "cte",
        "program of study"
      ],
      "answer": "Cadet Compass supports Texas CCMR advising by organizing a grade 8–12 plan, documenting student readiness artifacts (leadership, service, resume), and linking decisions to verified official sources. It complements endorsements and CTE programs of study (district-specific offerings vary)."
    }
  ]
}